---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.Distance
source: html/fbdfa9f5-a6fb-e335-689a-6935ca3a83d6.htm
---
# Autodesk.Revit.DB.WallSweepInfo.Distance Property

Represents the distance from either the top or base of the wall for horizontal sweeps,
 or the parameter along the wall's path curve for vertical ones.

## Syntax (C#)
```csharp
public double Distance { get; set; }
```